yaxn/keil-pack-milandr/Milandr.MDR1986BExx.pdsc
<?xml version="1.0" encoding="utf-8"?>
<package schemaVersion="1.3" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Milandr</vendor>
  <url>https://github.com/in4lio/mdr1986x-pack-repo/raw/master/</url>
  <name>MDR1986BExx</name>
  <description>Milandr MDR1986BExx Series Device Support, Drivers and Examples</description>

  <releases>
    <release version="1.4.2">
      20180428-0012, Updated emdr1986x-std-per-lib
    </release>
    <release version="1.4.1">
      20160208-0000, Initial release, based on https://github.com/eldarkg/emdr1986x-std-per-lib and https://github.com/eldarkg/emdr1986x-std-per-lib-doc
    </release>
  </releases>

  <devices>
    <family Dfamily="MDR1986" Dvendor="Milandr:99">
      <subFamily DsubFamily="Cortex-M3">
        <!-- MDR1986VE91 -->
        <device Dname="MDR1986VE91">
          <processor  Dcore="Cortex-M3" DcoreVersion="r0p0" Dfpu="NO_FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="80000000"/>
          <compile    header="Libraries/CMSIS/CM3/DeviceSupport/MDR32F9Qx/inc/MDR32Fx.h" define="USE_MDR32F9Q1_Rev1"/>
          <debug      svd="IDE/keil/SFD/MDR1986VE91.svd"/>
          <memory     id="IROM1"                          start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                          start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/1986VE9x.FLM"           start="0x08000000"  size="0x20000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
          <description>
            (1986VE91 RUS)
            Core:
             - 32-bit ARM Cortex-M3 processor, running at frequencies of up to 80 MHz
             - 1.25 DMIPS/MHz (Dhrystone 2.1) performance at 0 wait state memory access
             - memory Protection Unit (MPU)
             - 24-bit SysTick Timer

            Memory:
             - 128 KBytes of Flash memory (ISP and IAP)
             - 32 KBytes of SRAM
             - external system bus controller (support of SRAM, ROM and NAND Flash)

            Supply and Clock rate:
             - internal regulator for core voltage supply
             - built-in power control system
             - internal battery domain
             - internal 8 MHz RC clock generator with calibration
             - internal 40 kHz RC clockgenerator with calibration
             - external oscillator 2 .. 16 MHz
             - external oscillator 32 KHz
             - on-board PLL for clock frequency
             - dedicated PLL for USB clock frequency

            Low power consumption modes:
             - Sleep, Stop and Standby
             - battery domain with RTC and backup registers

            Analog features:
             - 2 * 12-bit ADC (16 channels)
             - conversion range: 0 to 3.6 V
             - temperature sensor
             - 2 * 12-bit DAC
             - internal comparator

            Peripheral features:
             - DMA controller (32 channel)
             - USB 2.0 full-speed OTG controller (Device and Host)
             - 3 Synch. 16-bit Timers (Input Capture, Output Compare, PWM)
             - 2 * CAN interface (2.0B)
             - 2 * UART
             - 2 * SPI
             - 1 * I2C
             - 96 GPIO pins

            Debug mode:
             - 2 * JTAG and SWD
          </description>
        </device>

        <!-- MDR1986VE92 -->
        <device Dname="MDR1986VE92">
          <processor  Dcore="Cortex-M3" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="80000000"/>
          <compile    header="Libraries/CMSIS/CM3/DeviceSupport/MDR32F9Qx/inc/MDR32Fx.h" define="USE_MDR32F9Q2_Rev1"/>
          <debug      svd="IDE/keil/SFD/MDR1986VE92.svd"/>
          <memory     id="IROM1"                          start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                          start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/1986VE9x.FLM"           start="0x08000000"  size="0x20000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
          <description>
            (1986VE92 RUS)
            Core:
             - 32-bit ARM Cortex-M3 processor, running at frequencies of up to 80 MHz
             - 1.25 DMIPS/MHz (Dhrystone 2.1) performance at 0 wait state memory access
             - memory Protection Unit (MPU)
             - 24-bit SysTick Timer

            Memory:
             - 128 KBytes of Flash memory (ISP and IAP)
             - 32 KBytes of SRAM
             - external system bus controller (support of SRAM, ROM and NAND Flash)

            Supply and Clock rate:
             - internal regulator for core voltage supply
             - built-in power control system
             - internal battery domain
             - internal 8 MHz RC clock generator with calibration
             - internal 40 kHz RC clockgenerator with calibration
             - external oscillator 2 .. 16 MHz
             - external oscillator 32 KHz
             - on-board PLL for clock frequency
             - dedicated PLL for USB clock frequency

            Low power consumption modes:
             - Sleep, Stop and Standby
             - battery domain with RTC and backup registers

            Analog features:
             - 12-bit ADC (8 channels)
             - conversion range: 0 to 3.6 V
             - temperature sensor
             - 12-bit DAC
             - internal comparator

            Peripheral features:
             - DMA controller (32 channel)
             - USB 2.0 full-speed OTG controller (Device and Host)
             - 3 Synch. 16-bit Timers (Input Capture, Output Compare, PWM)
             - 2 * CAN interface (2.0B)
             - 2 * UART
             - 2 * SPI
             - 1 * I2C
             - 45 GPIO pins

            Debug mode:
             - 2 * JTAG and SWD
          </description>
        </device>

        <!-- MDR1986VE93 -->
        <device Dname="MDR1986VE93">
          <processor  Dcore="Cortex-M3" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="80000000"/>
          <compile    header="Libraries/CMSIS/CM3/DeviceSupport/MDR32F9Qx/inc/MDR32Fx.h" define="USE_MDR32F9Q3_Rev1"/>
          <debug      svd="IDE/keil/SFD/MDR1986VE93.svd"/>
          <memory     id="IROM1"                          start="0x08000000"  size="0x20000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                          start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <algorithm  name="Flash/1986VE9x.FLM"           start="0x08000000"  size="0x20000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
          <description>
            (1986VE93 RUS)
            Core:
             - 32-bit ARM Cortex-M3 processor, running at frequencies of up to 80 MHz
             - 1.25 DMIPS/MHz (Dhrystone 2.1) performance at 0 wait state memory access
             - memory Protection Unit (MPU)
             - 24-bit SysTick Timer

