yaxn/keil-pack-milandr/Milandr.MDR1986BExx.pdsc
    <!-- Lib File -->
    <component Cclass="Drivers" Cgroup="LIB" Cversion="1.3.1" condition="CON_MDR1986Bxx">
      <description>LIB file for MDR1986BExx Series</description>
      <files>
        <file category="header" name="Libraries/MDR32F9Qx_StdPeriph_Driver/inc/MDR32F9Qx_lib.h"/>
      </files>
    </component>

    <!-- ADC Driver -->
    <component Cclass="Drivers" Cgroup="ADC" Cversion="1.3.1" condition="CON_MDR1986Bxx">
      <description>ADC driver for MDR1986BExx Series</description>
      <files>
        <file category="header" name="Libraries/MDR32F9Qx_StdPeriph_Driver/inc/MDR32F9Qx_adc.h"/>
        <file category="source" name="Libraries/MDR32F9Qx_StdPeriph_Driver/src/MDR32F9Qx_adc.c"/>
      </files>
    </component>

    <!-- BKP Driver -->
    <component Cclass="Drivers" Cgroup="BKP" Cversion="1.3.1" condition="CON_MDR1986Bxx">
      <description>BKP driver for MDR1986BExx Series</description>
      <files>
        <file category="header" name="Libraries/MDR32F9Qx_StdPeriph_Driver/inc/MDR32F9Qx_bkp.h"/>
        <file category="source" name="Libraries/MDR32F9Qx_StdPeriph_Driver/src/MDR32F9Qx_bkp.c"/>
      </files>
    </component>

    <!-- CAN Driver -->
    <component Cclass="Drivers" Cgroup="CAN" Cversion="1.3.1" condition="CON_MDR1986Bxx">
      <description>CAN driver for MDR1986BExx Series</description>
      <files>
        <file category="header" name="Libraries/MDR32F9Qx_StdPeriph_Driver/inc/MDR32F9Qx_can.h"/>
        <file category="source" name="Libraries/MDR32F9Qx_StdPeriph_Driver/src/MDR32F9Qx_can.c"/>
      </files>
    </component>

    <!-- COMP Driver -->
    <component Cclass="Drivers" Cgroup="COMP" Cversion="1.3.1" condition="CON_MDR1986VE9x">
      <description>COMP driver for MDR1986VE9x Series</description>
      <files>
        <file category="header" name="Libraries/MDR32F9Qx_StdPeriph_Driver/inc/MDR32F9Qx_comp.h"/>
        <file category="source" name="Libraries/MDR32F9Qx_StdPeriph_Driver/src/MDR32F9Qx_comp.c"/>
      </files>
    </component>

    <!-- DAC Driver -->
    <component Cclass="Drivers" Cgroup="DAC" Cversion="1.3.1" condition="CON_MDR1986Bxx">
      <description>DAC driver for MDR1986BExx Series</description>
      <files>
        <file category="header" name="Libraries/MDR32F9Qx_StdPeriph_Driver/inc/MDR32F9Qx_dac.h"/>
        <file category="source" name="Libraries/MDR32F9Qx_StdPeriph_Driver/src/MDR32F9Qx_dac.c"/>
      </files>
    </component>

    <!-- DMA Driver -->
    <component Cclass="Drivers" Cgroup="DMA" Cversion="1.3.1" condition="CON_MDR1986Bxx">
      <description>DMA driver for MDR1986BExx Series</description>
      <files>
        <file category="header" name="Libraries/MDR32F9Qx_StdPeriph_Driver/inc/MDR32F9Qx_dma.h"/>
        <file category="source" name="Libraries/MDR32F9Qx_StdPeriph_Driver/src/MDR32F9Qx_dma.c"/>
      </files>
    </component>

    <!-- EBC Driver -->
    <component Cclass="Drivers" Cgroup="EBC" Cversion="1.3.1" condition="CON_MDR1986Bxx">
      <description>EBC driver for MDR1986BExx Series</description>
      <files>
        <file category="header" name="Libraries/MDR32F9Qx_StdPeriph_Driver/inc/MDR32F9Qx_ebc.h"/>
        <file category="source" name="Libraries/MDR32F9Qx_StdPeriph_Driver/src/MDR32F9Qx_ebc.c"/>
      </files>
    </component>

    <!-- EEPROM Driver -->
    <component Cclass="Drivers" Cgroup="EEMPROM" Cversion="1.3.1" condition="CON_MDR1986Bxx">
      <description>EEPROM driver for MDR1986BExx Series</description>
      <files>
        <file category="header" name="Libraries/MDR32F9Qx_StdPeriph_Driver/inc/MDR32F9Qx_eeprom.h"/>
        <file category="source" name="Libraries/MDR32F9Qx_StdPeriph_Driver/src/MDR32F9Qx_eeprom.c"/>
      </files>
    </component>

    <!-- I2C Driver -->
    <component Cclass="Drivers" Cgroup="I2C" Cversion="1.3.1" condition="CON_MDR1986VE9x">
      <description>I2C driver for MDR1986VE9x Series</description>
      <files>
        <file category="header" name="Libraries/MDR32F9Qx_StdPeriph_Driver/inc/MDR32F9Qx_i2c.h"/>
        <file category="source" name="Libraries/MDR32F9Qx_StdPeriph_Driver/src/MDR32F9Qx_i2c.c"/>
      </files>
    </component>

    <!-- IWDG Driver -->
    <component Cclass="Drivers" Cgroup="IWDG" Cversion="1.3.1" condition="CON_MDR1986Bxx">
      <description>IWDG driver for MDR1986BExx Series</description>
      <files>
        <file category="header" name="Libraries/MDR32F9Qx_StdPeriph_Driver/inc/MDR32F9Qx_iwdg.h"/>
        <file category="source" name="Libraries/MDR32F9Qx_StdPeriph_Driver/src/MDR32F9Qx_iwdg.c"/>
      </files>
    </component>

    <!-- PORT Driver -->
    <component Cclass="Drivers" Cgroup="PORT" Cversion="1.3.1" condition="CON_MDR1986Bxx">
      <description>PORT driver for MDR1986BExx Series</description>
      <files>
        <file category="header" name="Libraries/MDR32F9Qx_StdPeriph_Driver/inc/MDR32F9Qx_port.h"/>
        <file category="source" name="Libraries/MDR32F9Qx_StdPeriph_Driver/src/MDR32F9Qx_port.c"/>
      </files>
    </component>

    <!-- POWER Driver -->
    <component Cclass="Drivers" Cgroup="POWER" Cversion="1.3.1" condition="CON_MDR1986Bxx">
      <description>POWER driver for MDR1986BExx Series</description>
      <files>
        <file category="header" name="Libraries/MDR32F9Qx_StdPeriph_Driver/inc/MDR32F9Qx_power.h"/>
        <file category="source" name="Libraries/MDR32F9Qx_StdPeriph_Driver/src/MDR32F9Qx_power.c"/>
      </files>
    </component>

    <!-- RST_CLK Driver -->
    <component Cclass="Drivers" Cgroup="RST_CLK" Cversion="1.3.1" condition="CON_MDR1986Bxx">
      <description>RST_CLK driver for MDR1986BExx Series</description>
      <files>
        <file category="header" name="Libraries/MDR32F9Qx_StdPeriph_Driver/inc/MDR32F9Qx_rst_clk.h"/>
        <file category="source" name="Libraries/MDR32F9Qx_StdPeriph_Driver/src/MDR32F9Qx_rst_clk.c"/>
      </files>
    </component>

    <!-- SSP Driver -->
    <component Cclass="Drivers" Cgroup="SSP" Cversion="1.3.1" condition="CON_MDR1986Bxx">
      <description>SSP driver for MDR1986BExx Series</description>
      <files>
        <file category="header" name="Libraries/MDR32F9Qx_StdPeriph_Driver/inc/MDR32F9Qx_ssp.h"/>
        <file category="source" name="Libraries/MDR32F9Qx_StdPeriph_Driver/src/MDR32F9Qx_ssp.c"/>
      </files>
    </component>

    <!-- TIMER Driver -->
    <component Cclass="Drivers" Cgroup="TIMER" Cversion="1.3.1" condition="CON_MDR1986Bxx">
      <description>TIMER driver for MDR1986BExx Series</description>
      <files>
        <file category="header" name="Libraries/MDR32F9Qx_StdPeriph_Driver/inc/MDR32F9Qx_timer.h"/>
        <file category="source" name="Libraries/MDR32F9Qx_StdPeriph_Driver/src/MDR32F9Qx_timer.c"/>
      </files>
    </component>

    <!-- UART Driver -->
    <component Cclass="Drivers" Cgroup="UART" Cversion="1.3.1" condition="CON_MDR1986Bxx">
      <description>UART driver for MDR1986BExx Series</description>
      <files>
        <file category="header" name="Libraries/MDR32F9Qx_StdPeriph_Driver/inc/MDR32F9Qx_uart.h"/>
        <file category="source" name="Libraries/MDR32F9Qx_StdPeriph_Driver/src/MDR32F9Qx_uart.c"/>
      </files>
    </component>

    <!-- MIL_STD_1553 Driver -->
    <component Cclass="Drivers" Cgroup="MIL_STD_1553" Cversion="1.3.1" condition="CON_MDR1986BExT">
      <description>MIL_STD_1553 driver for MDR1986BE1T and MDR1986BE3T</description>
      <files>
        <file category="header" name="Libraries/MDR32F9Qx_StdPeriph_Driver/inc/MDR32F9Qx_mil_std_1553.h"/>
        <file category="source" name="Libraries/MDR32F9Qx_StdPeriph_Driver/src/MDR32F9Qx_mil_std_1553.c"/>
      </files>
    </component>

    <!-- ARINC429R Driver -->
    <component Cclass="Drivers" Cgroup="ARINC429R" Cversion="1.3.1" condition="CON_MDR1986BExT">
      <description>ARINC429R driver for MDR1986BE1T and MDR1986BE3T</description>
      <files>
        <file category="header" name="Libraries/MDR32F9Qx_StdPeriph_Driver/inc/MDR32F9Qx_arinc429r.h"/>
        <file category="source" name="Libraries/MDR32F9Qx_StdPeriph_Driver/src/MDR32F9Qx_arinc429r.c"/>
      </files>
    </component>

    <!-- ARINC429T  Driver -->
    <component Cclass="Drivers" Cgroup="ARINC429T" Cversion="1.3.1" condition="CON_MDR1986BExT">
      <description>ARINC429T driver for MDR1986BE1T and MDR1986BE3T</description>
      <files>
        <file category="header" name="Libraries/MDR32F9Qx_StdPeriph_Driver/inc/MDR32F9Qx_arinc429t.h"/>
        <file category="source" name="Libraries/MDR32F9Qx_StdPeriph_Driver/src/MDR32F9Qx_arinc429t.c"/>
      </files>
    </component>

    <!-- Audio  Driver -->
    <component Cclass="Drivers" Cgroup="Audio" Cversion="1.3.1" condition="CON_MDR1986BE3T">
      <description>Audio driver for MDR1986BE3T</description>
      <files>
        <file category="header" name="Libraries/MDR32F9Qx_StdPeriph_Driver/inc/MDR32F9Qx_audio.h"/>
        <file category="source" name="Libraries/MDR32F9Qx_StdPeriph_Driver/src/MDR32F9Qx_audio.c"/>
      </files>
    </component>

    <!-- Ethernet  Driver -->
    <component Cclass="Drivers" Cgroup="Ethernet" Cversion="1.3.1" condition="CON_MDR1986BExT">
      <description>Ethernet driver for MDR1986BE1T and MDR1986BE3T</description>
      <files>
        <file category="header" name="Libraries/MDR32F9Qx_StdPeriph_Driver/inc/MDR32F9Qx_eth.h"/>
        <file category="source" name="Libraries/MDR32F9Qx_StdPeriph_Driver/src/MDR32F9Qx_eth.c"/>
      </files>
    </component>

    <!-- LED Driver -->
    <component Cclass="Drivers" Cgroup="LED" Cversion="1.3.1" condition="CON_MDR1986BE3T">
      <description>LED driver for MDR1986BE3T</description>
      <files>
        <file category="header" name="Libraries/MDR32F9Qx_StdPeriph_Driver/inc/MDR32F9Qx_led.h"/>
        <file category="source" name="Libraries/MDR32F9Qx_StdPeriph_Driver/src/MDR32F9Qx_led.c"/>
      </files>
    </component>

    <!-- Keypad  Driver -->
    <component Cclass="Drivers" Cgroup="Keypad" Cversion="1.3.1" condition="CON_MDR1986BE3T">
      <description>Keypad driver for MDR1986BE3T</description>
      <files>
        <file category="header" name="Libraries/MDR32F9Qx_StdPeriph_Driver/inc/MDR32F9Qx_keypad.h"/>
        <file category="source" name="Libraries/MDR32F9Qx_StdPeriph_Driver/src/MDR32F9Qx_keypad.c"/>
      </files>
    </component>

    <!-- USB Driver -->
    <component Cclass="Drivers" Cgroup="USB" Cversion="1.3.1" condition="CON_MDR1986Bxx">
      <description>USB driver for MDR1986BExx Series</description>
      <files>
        <file category="header" name="Libraries/MDR32F9Qx_StdPeriph_Driver/inc/MDR32F9Qx_usb.h"/>
        <file category="source" name="Libraries/MDR32F9Qx_StdPeriph_Driver/src/MDR32F9Qx_usb.c"/>
      </files>
    </component>

