yaxn/keil-pack-milandr/Milandr.MDR1986BExx.pdsc
    <!-- USB Library Driver -->
    <component Cclass="Drivers" Cgroup="USB Library" Cversion="1.3.1" condition="CON_MDR1986Bxx">
      <description>USB Library for MDR1986VE9x Series</description>
      <files>
        <file category="header" name="Libraries/MDR32F9Qx_StdPeriph_Driver/inc/USB_Library/MDR32F9Qx_usb_CDC.h"/>
        <file category="header" name="Libraries/MDR32F9Qx_StdPeriph_Driver/inc/USB_Library/MDR32F9Qx_usb_device.h"/>
        <file category="source" name="Libraries/MDR32F9Qx_StdPeriph_Driver/src/USB_Library/MDR32F9Qx_usb_CDC.c"/>
        <file category="source" name="Libraries/MDR32F9Qx_StdPeriph_Driver/src/USB_Library/MDR32F9Qx_usb_device.c"/>
      </files>
    </component>

    <!-- STD for 1986BE4 -->
    <!-- ADC Driver -->
    <component Cclass="Drivers" Cgroup="ADC" Cversion="1.3.1" condition="CON_MDR1986BE4">
      <description>ADC driver for MDR1986BE4</description>
      <files>
        <file category="header" name="Libraries/MDR1986BE4_StdPeriph_Driver/inc/MDR32F9Qx_ADC.h"/>
        <file category="source" name="Libraries/MDR1986BE4_StdPeriph_Driver/src/MDR32F9Qx_ADC.c"/>
      </files>
    </component>

    <!-- ADCIU Driver -->
    <component Cclass="Drivers" Cgroup="ADCIU" Cversion="1.3.1" condition="CON_MDR1986BE4">
      <description>ADCIU driver for MDR1986BE4</description>
      <files>
        <file category="header" name="Libraries/MDR1986BE4_StdPeriph_Driver/inc/MDR32F9Qx_adciu.h"/>
        <file category="source" name="Libraries/MDR1986BE4_StdPeriph_Driver/src/MDR32F9Qx_adciu.c"/>
      </files>
    </component>

    <!-- BKP  Driver -->
    <component Cclass="Drivers" Cgroup="BKP" Cversion="1.3.1" condition="CON_MDR1986BE4">
      <description>BKP driver for MDR1986BE4</description>
      <files>
        <file category="header" name="Libraries/MDR1986BE4_StdPeriph_Driver/inc/MDR32F9Qx_BKP.h"/>
        <file category="source" name="Libraries/MDR1986BE4_StdPeriph_Driver/src/MDR32F9Qx_BKP.c"/>
      </files>
    </component>

    <!-- COMP  Driver -->
    <component Cclass="Drivers" Cgroup="COMP" Cversion="1.3.1" condition="CON_MDR1986BE4">
      <description>COMP driver for MDR1986BE4</description>
      <files>
        <file category="header" name="Libraries/MDR1986BE4_StdPeriph_Driver/inc/MDR32F9Qx_comp.h"/>
        <file category="source" name="Libraries/MDR1986BE4_StdPeriph_Driver/src/MDR32F9Qx_comp.c"/>
      </files>
    </component>

    <!-- CRC  Driver -->
    <component Cclass="Drivers" Cgroup="CRC" Cversion="1.3.1" condition="CON_MDR1986BE4">
      <description>CRC driver for MDR1986BE4</description>
      <files>
        <file category="header" name="Libraries/MDR1986BE4_StdPeriph_Driver/inc/MDR32F9Qx_crc.h"/>
        <file category="source" name="Libraries/MDR1986BE4_StdPeriph_Driver/src/MDR32F9Qx_crc.c"/>
      </files>
    </component>

    <!-- DAC Driver -->
    <component Cclass="Drivers" Cgroup="DAC" Cversion="1.3.1" condition="CON_MDR1986BE4">
      <description>DAC driver for MDR1986BE4</description>
      <files>
        <file category="header" name="Libraries/MDR1986BE4_StdPeriph_Driver/inc/MDR32F9Qx_dac.h"/>
        <file category="source" name="Libraries/MDR1986BE4_StdPeriph_Driver/src/MDR32F9Qx_dac.c"/>
      </files>
    </component>

    <!-- DMA  Driver -->
    <component Cclass="Drivers" Cgroup="DMA" Cversion="1.3.1" condition="CON_MDR1986BE4">
      <description>DMA driver for MDR1986BE4</description>
      <files>
        <file category="header" name="Libraries/MDR1986BE4_StdPeriph_Driver/inc/MDR32F9Qx_dma.h"/>
        <file category="source" name="Libraries/MDR1986BE4_StdPeriph_Driver/src/MDR32F9Qx_dma.c"/>
      </files>
    </component>

    <!-- EEPROM  Driver -->
    <component Cclass="Drivers" Cgroup="EEPROM" Cversion="1.3.1" condition="CON_MDR1986BE4">
      <description>EEPROM driver for MDR1986BE4</description>
      <files>
        <file category="header" name="Libraries/MDR1986BE4_StdPeriph_Driver/inc/MDR32F9Qx_eeprom.h"/>
        <file category="source" name="Libraries/MDR1986BE4_StdPeriph_Driver/src/MDR32F9Qx_eeprom.c"/>
      </files>
    </component>

    <!-- IWDG Driver -->
    <component Cclass="Drivers" Cgroup="IWDG" Cversion="1.3.1" condition="CON_MDR1986BE4">
      <description>IWDG driver for MDR1986BE4</description>
      <files>
        <file category="header" name="Libraries/MDR1986BE4_StdPeriph_Driver/inc/MDR32F9Qx_iwdg.h"/>
        <file category="source" name="Libraries/MDR1986BE4_StdPeriph_Driver/src/MDR32F9Qx_iwdg.c"/>
      </files>
    </component>

    <!-- PORT  Driver -->
    <component Cclass="Drivers" Cgroup="PORT" Cversion="1.3.1" condition="CON_MDR1986BE4">
      <description>PORT driver for MDR1986BE4</description>
      <files>
        <file category="header" name="Libraries/MDR1986BE4_StdPeriph_Driver/inc/MDR32F9Qx_port.h"/>
        <file category="source" name="Libraries/MDR1986BE4_StdPeriph_Driver/src/MDR32F9Qx_port.c"/>
      </files>
    </component>

    <!-- POWER  Driver -->
    <component Cclass="Drivers" Cgroup="POWER" Cversion="1.3.1" condition="CON_MDR1986BE4">
      <description>POWER driver for MDR1986BE4</description>
      <files>
        <file category="header" name="Libraries/MDR1986BE4_StdPeriph_Driver/inc/MDR32F9Qx_power.h"/>
        <file category="source" name="Libraries/MDR1986BE4_StdPeriph_Driver/src/MDR32F9Qx_power.c"/>
      </files>
    </component>

    <!-- RST_CLK  Driver -->
    <component Cclass="Drivers" Cgroup="RST_CLK" Cversion="1.3.1" condition="CON_MDR1986BE4">
      <description>RST_CLK driver for MDR1986BE4</description>
      <files>
        <file category="header" name="Libraries/MDR1986BE4_StdPeriph_Driver/inc/MDR32F9Qx_rst_clk.h"/>
        <file category="source" name="Libraries/MDR1986BE4_StdPeriph_Driver/src/MDR32F9Qx_rst_clk.c"/>
      </files>
    </component>

    <!-- SSP Driver -->
    <component Cclass="Drivers" Cgroup="SSP" Cversion="1.3.1" condition="CON_MDR1986BE4">
      <description>SSP driver for MDR1986BE4</description>
      <files>
        <file category="header" name="Libraries/MDR1986BE4_StdPeriph_Driver/inc/MDR32F9Qx_ssp.h"/>
        <file category="source" name="Libraries/MDR1986BE4_StdPeriph_Driver/src/MDR32F9Qx_ssp.c"/>
      </files>
    </component>

    <!-- TIMER Driver -->
    <component Cclass="Drivers" Cgroup="TIMER" Cversion="1.3.1" condition="CON_MDR1986BE4">
      <description>TIMER driver for MDR1986BE4</description>
      <files>
        <file category="header" name="Libraries/MDR1986BE4_StdPeriph_Driver/inc/MDR32F9Qx_timer.h"/>
        <file category="source" name="Libraries/MDR1986BE4_StdPeriph_Driver/src/MDR32F9Qx_timer.c"/>
      </files>
    </component>

    <!-- UART Driver -->
    <component Cclass="Drivers" Cgroup="UART" Cversion="1.3.1" condition="CON_MDR1986BE4">
      <description>UART driver for MDR1986BE4</description>
      <files>
        <file category="header" name="Libraries/MDR1986BE4_StdPeriph_Driver/inc/MDR32F9Qx_uart.h"/>
        <file category="source" name="Libraries/MDR1986BE4_StdPeriph_Driver/src/MDR32F9Qx_uart.c"/>
      </files>
    </component>

    <!-- WWDG Driver -->
    <component Cclass="Drivers" Cgroup="WWDG" Cversion="1.3.1" condition="CON_MDR1986BE4">
      <description>WWDG driver for MDR1986BE4</description>
      <files>
        <file category="header" name="Libraries/MDR1986BE4_StdPeriph_Driver/inc/MDR32F9Qx_wwdg.h"/>
        <file category="source" name="Libraries/MDR1986BE4_StdPeriph_Driver/src/MDR32F9Qx_wwdg.c"/>
      </files>
    </component>

